#Использовать asserts
#Использовать "../src/cmd"

Перем юТест;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;

	ИменаТестов = Новый Массив;
	ИменаТестов.Добавить("ТестДолжен_ЗапретитьОпциюМинусAll");
	ИменаТестов.Добавить("ТестДолжен_РазрешитьОпциюДвойнойМинусAll");

	Возврат ИменаТестов;

КонецФункции

Процедура ПередЗапускомТеста() Экспорт
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
КонецПроцедуры

Процедура ТестДолжен_ЗапретитьОпциюМинусAll() Экспорт

	Попытка
		ПараметрыПриложенияOpm.ПроверитьАргументыКоманднойСтроки(СоздатьАргументыЗапуска("install", "-all"));
	Исключение
		Если ИнформацияОбОшибке().Описание = "Опция -all не поддерживается. Используйте --all." Тогда
			Возврат;
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;

	юТест.ПрерватьТест("Ожидали, что для -all будет выброшено исключение");

КонецПроцедуры

Процедура ТестДолжен_РазрешитьОпциюДвойнойМинусAll() Экспорт

	АргументыЗапуска = СоздатьАргументыЗапуска("install", "--all");

	ПараметрыПриложенияOpm.ПроверитьАргументыКоманднойСтроки(АргументыЗапуска);

	Утверждения.ПроверитьРавенство(2, АргументыЗапуска.Количество());
	Утверждения.ПроверитьРавенство("--all", АргументыЗапуска[1]);

КонецПроцедуры

Функция СоздатьАргументыЗапуска(Знач ПервыйАргумент, Знач ВторойАргумент)

	АргументыЗапуска = Новый Массив;
	АргументыЗапуска.Добавить(ПервыйАргумент);
	АргументыЗапуска.Добавить(ВторойАргумент);

	Возврат АргументыЗапуска;

КонецФункции
